function vacationBookList(NumberPages, Pages, Days) {
    // 1.	Брой страници в текущата книга – цяло число в интервала [1…1000]
    // 2.	Страници, които прочита за 1 час – цяло число в интервала [1…1000]
    // 3.	Броят на дните, за които трябва да прочете книгата – цяло число в интервала [1…1000]
    let Hours = (NumberPages / Pages) / Days;

    // Да се отпечата на конзолата броят часове, които Жоро трябва да отделя за четене всеки ден.
    console.log(Hours);
}

vacationBookList(212, 20, 2);