function Repainting(naylon, paintliters, razreditel, hours) {
    // •	Предпазен найлон - 1.50 лв. за кв. метър
    // •	Боя - 14.50 лв. за литър
    // •	Разредител за боя - 5.00 лв. за литър
    let amount = (((naylon + 2) * 1.50) + ((paintliters + (paintliters * 0.1)) * 14.50) + (razreditel * 5) + 0.40);
    let labourcost =  (0.3 * amount) * hours;
    totalcost = amount + labourcost;
    //     Входът се чете от конзолата и съдържа точно 4 реда:
    // 1.	Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
    // 2.	Необходимо количество боя (в литри) - цяло число в интервала [1…100]
    // 3.	Количество разредител (в литри) - цяло число в интервала [1…30]
    // 4.	Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]

    console.log(totalcost);
}

Repainting(10, 11, 4, 8);